# Chapter 04 : 데이터 프레임의 세계로!
## 1. 데이터 프레임 이해하기 - 데이터는 어떻게 생겼나?
## 데이터 프레임 (data frame)
#### 데이터를 다룰 때 가장 많이 사용하는 데이터 형태
#### 행과 열로 구성된 사각형 모양의 표

### 열
#### 세로로 나열
#### 속성을 나타냄
#### 컬럼 (column) or 변수 (variable)

### 행
#### 가로로 나열
#### 무엇이든 하나의 단위가 하나의 행으로 구성
#### 로 (row) or 케이스 (case)

### 데이터가 크다
#### 행이 많은 것 VS 열이 많은 것
#### 열이 많은 것이 더 중요!
#### 열이 많이지면 조합할 수 있는 변수의 경우가 늘어남
#### 변수가 늘어나면 단순한 분석 방법으로 해결하기 힘듦
#### 여러 변수의 영향을 동시에 고려하는 복잡한 분석 방법을 활용해야 함

## 2. 데이터 프레임 만들기 - 시험 성적 데이터를 만들어 보자!
## 데이터 프레임 만들기
### pandas 패키지 로드

In [1]:
import pandas as pd

### 데이터 프레임 만들기
#### pandas의 DataFrame() 함수 이용
#### DataFrame({변수명 : [값1, 값2, ...], 변수명 : [값1, 값2, ...], ...})

In [2]:
df = pd.DataFrame({'name' : ['김지훈', '이유진', '박동현', '김민지'],
                  'english' : [90, 80, 60, 70],
                  'math' : [50, 60, 100, 20]})
df

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

#### 특정 변수의 값 추출
#### 데이터 프레임 이름['변수명']

In [3]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [4]:
sum(df['english'])

300

In [5]:
sum(df['math'])

230

In [6]:
sum(df['english']) / 4

75.0

In [7]:
sum(df['math']) / 4

57.5

## 3. 외부 데이터 이용하기 - 축적된 시험 성적 데이터를 불러오자!
## 외부 데이터 이용하기
### 엑셀 파일 불러오기
##### 데이터 출처 : https://bit.ly/doit_python

#### excel_exam.xlsx 파일 다운 -> 워킹 디렉터리에 엑셀 파일 삽입
#### pandas의 read_excel() 함수 이용
#### read_excel('파일명')
#### read_excel('파일경로')

In [13]:
df_exam = pd.read_excel('excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [15]:
df_exam = pd.read_excel('C:/Users/82108/Doit 데이터 분석/excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

### 분석하기

In [16]:
sum(df_exam['english']) / 20

84.9

In [17]:
sum(df_exam['science']) / 20

59.45

#### len() 함수 : 값의 개수를 구함
#### len(변수) : 변수에 들어 있는 값의 개수 출력
#### len(데이터 프레임) : 행의 개수 출력

In [18]:
x = [1, 2, 3, 4, 5]
x

[1, 2, 3, 4, 5]

In [19]:
len(x)

5

In [20]:
df = pd.DataFrame({'a' : [1, 2, 3],
                  'b' : [4, 5, 6]})
df

   a  b
0  1  4
1  2  5
2  3  6

In [21]:
len(df)

3

In [22]:
len(df_exam)

20

In [23]:
sum(df_exam['english']) / len(df_exam)

84.9

In [24]:
sum(df_exam['science']) / len(df_exam)

59.45

#### read_excel() 함수 = 첫 번째 행을 변수명으로 인식
#### 엑셀 파일의 첫 번째 행이 변수명이 아니면 첫 번째 행의 데이터가 변수명으로 지정, 데이터가 유실됨
#### read_excel() 함수의 header 옵션에 None 입력 (첫 번째 행을 변수명이 아닌 데이터로 인식)

In [25]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx')
df_exam_novar

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45
5  7    4  46  98    65
6  8    4  48  87    12

In [26]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12

#### 엑셀 파일에 시트가 여러 개 있을 때, 특정 시트의 데이터만 불러오기
#### sheet_name 옵션 이용 (파이썬에서는 숫자를 0부터 센다!)

In [ ]:
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 'Sheet2')
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 2)

### CSV 파일 불러오기
#### exam.csv 파일 다운 -> 워킹 디렉터리에 CSV 파일 삽입
#### pandas의 read_csv() 함수 이용
#### read_csv('파일명')
#### read_csv('파일경로')

In [28]:
df_csv_exam = pd.read_csv('exam.csv')
df_csv_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

## 데이터 프레임 CSV 파일로 저장하기
### to_csv() 함수 이용
#### 데이터 프레임 이름.to_csv('저장할 파일 이름')
#### index 옵션 : 첫 번째 열에 있는 인덱스 번호 포함 여부
#### index = False : 첫 번째 열에 있는 인덱스 번호 제외하고 저장 (default = True)

In [29]:
df_midterm = pd.DataFrame({'english' : [90, 80, 60, 70],
                          'math' : [50, 60, 100, 20],
                          'nclass' : [1, 1, 2, 2]})
df_midterm

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

In [31]:
df_midterm.to_csv('output_newdata.csv')
df = pd.read_csv('output_newdata.csv')
df

   Unnamed: 0  english  math  nclass
0           0       90    50       1
1           1       80    60       1
2           2       60   100       2
3           3       70    20       2

In [32]:
df_midterm.to_csv('output_newdata.csv', index = False)
df = pd.read_csv('output_newdata.csv')
df

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

## Chapter 04 정리

### Q1 다음 표의 내용을 데이터 프레임으로 만들어 출력해 보세요.

In [8]:
df = pd.DataFrame({'제품' : ['사과', '딸기', '수박'],
                  '가격' : [1800, 1500, 3000],
                  '판매량' : [24, 38, 13]})
df

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

### Q2 앞에서 만든 데이터 프레임을 이용해 과일의 가격 평균과 판매량 평균을 구해 보세요.

In [9]:
sum(df['가격']) / 3

2100.0

In [10]:
sum(df['판매량']) / 3

25.0